import 'package:flutter/material.dart';

class Colonel extends StatefulWidget {
  const Colonel({super.key});

  @override
  State<Colonel> createState() => _colonelState();
}

// ignore: camel_case_types
class _colonelState extends State<Colonel> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(' history colonel bezabi petros'),
        automaticallyImplyLeading: false,
        leading: IconButton(
          onPressed: () {
            Navigator.of(context).pop();
          },
          icon: const Icon(Icons.arrow_back_ios),
        ),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset('images/haddiya9.jpg'),
            const SizedBox(
              height: 50,
            ),
            const Divider(
              color: Color.fromARGB(255, 0, 0, 0),
            ),
            Container(
              margin: const EdgeInsets.all(10.0),
              padding: const EdgeInsets.all(10.0),
              color: Colors.blueGrey,
              width: double.infinity,
              child: InteractiveViewer(
                child: InteractiveViewer(
                  maxScale: 5.0,
                  minScale: 1.0,
                  child: const Center(
                    child: Text(
                      """  ለሀገራችን ኢትዮጵያ ሉዓላዊነት እና ክብር በግንባር ቀደምትነት ተሰልፈው ታላቅ ገድል ከፈፀሙ በርካታ ጀግኖች መሀል አንዱ ነው፡፡ በፈፀመው ወደር የሌለው ጀግንነት ሊታወስ የሚገባ የሀገር ኩራት፡- ነገር ግን ጀግንነቱ በወጉ ያልተነገረት፡፡
                              እሱ ለኢትዮጵያ አየር ኃይል ዘላለማዊ ኩራት ከሆኑ ድንቅና ብርቅዬ ተዋጊዎች መሃል በጀግንነቱ በግንባር ቀደምትነት የሚጠቀስ ነው፡፡ በ1944 ዓም የተወለደው ይህ ብርቅዬ ጀግና ታላቅ ገድል ከፈፀመባቸው የውጊያ ውሎዎቹ መሃል የሐምሌ 27 ቀን 1969 ዓ.ምህረቱ ይቀድማል፡፡ በዚያ ወቅት ትምክህተኛው የዚያድባሬ መንግስት በምስራቅ ኢትዮጵያ ግዙፍ ወታደራዊ ወረራ ፈፅሞ ነበር፡፡ ይህንን ወረራ ለመመከት ከተሰማሩት የአየር ኃይል (አሜሪካ ሰራሽ ኤፍ 5 ኢ) ተዋጊ ጀቶች መሃል አንዱን የያዘው እሱ ነው፡፡ እናም በኦጋዴን ሐረዋ፣ አይሻ፣ በእነኖሜጢ እና በሌሎችም ቦታዎች የሮኬት ናዳ በማውረድ ወራሪውን የሶማሊያ ጦር ባለበት እንዲገታ ከማድረግ ባሻገር፣ 8 የጠላት ታንኮችን ከእነ ምድብተኛው ረመረመ፡፡ ይህንን ታላቅ ጀግንነት ባስመዘገበ በ10 ሰዓት ልዩነት እንደገና ወደምስራቅ ጦር ግንባር በመብረር የኢትዮጵያን አየር ኃይል ብቃት ያስመሰከረም ነው ፡- እሱ፡፡
                              ገድሉ ይቀጥላል፡-….. ጥቅምት 7 ቀን 1970 ዓም፡፡
                              የኢትዮጵያ ሠራዊት በጅጅጋ ካራማራ ላይ ከፍተኛ ትንቅንቅ ላይ ይገኛል፡፡ ያኔ እሱ ከላይ ከሰማይ በሚያወረደው ቦንብ የሶማሊያን ወራሪ ጦር ብትንትኑን ማውጣት ተያያዘ፡፡ በዚህ ጊዜ ከጠላት ወገን በተኮሰ አየር መቃወሚያ የሚቀዝፈው ኤፍ 5 ኢ ተዋጊ ጀት ተመታ፡፡ ይኼኔ እሱ በዥንጥላ ወርዶ ህይወቱን ማትረፍ ነበረበት፡፡ ነገር ግን የሚያበረውንም ጀት ጭምር እንጂ የራሱን ህይወት ብቻ ማትረፍ አልፈቀደም፡፡ እናም የሚያበረውን ጀት በቆራጥነት እየቀዘፈ ወደ ደብረዘይት አየር ማረፊያ ገስግሶ በሰላም አረፈ፡፡ የተመታውም ጀት ተጠግኖ እንደገና ለግዳጅ ተሰማራ፡፡
                              የጀግናው ገድል ይቀጥላል፡-
                              ሐምሌ 30 ቀን 1969 ዓ.ም
                              በነገሌ ቦረና ግንባር የተሰማራውን የሶማሊያ ጦር የቦንብ ናዳ በማውረድ ጠላትን ብትንትኑን ማውጣቱን ቀጠለ፡፡ ይህ ብቻ አይደለም፤ ሁለት የሶማሊያ ጦር ጀቶችን በአየር ላይ አጋይቶ ጣለ፡፡ የሚገርመው አንዱን የሶማሊያ ጦር ጀት ያጋየው ሶማሊያ ግዛት ውስጥ ዘልቆ ገብቶ መሆኑ ነው፡፡
                              አሁንም የጀግናው ገድል ይቀጥላል፡-
                              ጥቅምት ወር 1970 ዓ.ም፡- የሶማሊያ ጦር ጀቶች ድሬደዋ ከተማ ላይ ጥቃት ፈፀሙ፡፡ ይኼኔ ለጥቃቱ የአፀፋ መልስ እንዲሰጡ የኢትዮጵያ አየር ኃይል ተዋጊዎች ታዘዙ፡፡ ከታዘዙት ተዋጊዎች መሃል አንዱ እሱ ነበር፡፡ እናም ጀቱን እየቀዘፈ የአየር ላይ ትርዒት ጭምር በማሳየት ጀግናው ገድሉን ቀጠለ፡፡ እናም የሶማሊያን ሚግ 21 ተዋጊ ጀት ከነአብራሪው በአየር ላይ አጋይቶ በሰላም ወደደብረዘይት ተመለሰ፡፡
                              እነሆ ይህ ጀግና እንዲህ ያለ አኩሪ ገድል የፈፀመ ነው፡፡
                              ማነው?
                              ይህ ጀግና ኮሎኔል በዛብህ ጴጥሮስ ይባላል፡፡ (በነገራችን ላይ ኮሎኔል በዛብህ ፤የፕ/ር በየነ ጴጥሮስ ወንድም ነው፡፡)ከላይ የጠቀስነውን ጀግንነት በፈፀመ ጊዜ የሻለቅነት ወታደራዊ ማዕረግ ነው የነበረው፡፡ የሆነ ሆኖ የጀግናችንን አኩሪ ገድል መተረካችንን እንቀጥል፡፡
                              ሕዳር 3 ቀን 1970 ዓ.ም፡፡
                              የሶማሊያ ተዋጊ አውሮፕላኖች ወደ ኢትዮጵያ ገብተው ጥቃት ፈፅመው ተመለሱ፡፡ ይኼኔ ሁለት የኢትዮጵያ ተዋጊዎች (ሻለቃ በዛብህ ጴጥሮስ እና ኮሎኔል ለገሰ ተፈራ) ተከትለዋቸው ገሰገሱ፡- እስከ ሞቃዲሾ ድረስ፡፡ የሶማሊያ አውሮፕላኖች ሞቃድሾ አየር ማረፊያ ደርሰው ለማረፍ ዝቅ ሲሉ፤ ጀግኖቹ ሻለቃ በዛብህና ኮሎኔል ለገሰ ተፈራ እዚያው ደፍቀው አጋዩአቸው፡፡ እናም በሰላም (እየሸለሉ) ወደደብረዘይት ተመለሱ፡፡ ይህ የጀግኖቻችን ተግባር ለሶማሊያውያን ዘላለማዊ ውርደት ያከናነነበ እንደነበር ታሪክ ይመሰክራል፡፡
                              የጀግናው በዛብህ ጴጥሮስ ገድል ይቀጥላል፡-
                              ታህሳስ 13 ቀን 1970 ዓም
                              በዛብህ፤ ዩጎ ውጫሌ በሚባል ቦታ ላይ የሚገኝን የሶማሊያ ጦር መሳሪያ ግምጃ ቤት እና መካናይዝድ ክፍለጦር መምሪያ በቦንብ እያጋየ ሳለ ከጠላት ወገን በተተኮሰበት አየር መቃወሚያ ጥይት የሚያበረው አውሮፕላን ሞተር ክፍል ተመታበት፡፡ በዛብህ ጴጥሮስ አውሮፕላኑ ክፉኛ ቢመታም አልተደናገጠም፡፡ የተመታውን አውሮፕላን መልሶ ደብረዘይት ለማሳረፍ ታላቅ ጥረት አደረገ፡፡ ሆኖም ጥረቱ አልተሳካም፡ የአውሮፕላኑ ነዳጅ አለቀበት፡፡ በዚህ የተነሳ ደብረዘይትና ሞጆ መሃል በሚገኝ ገላጣ ሜዳ ላይ አውሮፕላኑን አሳርፎ ድርብ ጀግንነቱን አስመሰከረ፡፡
                              ጀግናው በዛብህ ጴጥሮስ፤ በኢትዮጵያና በሶማሊያ ድንበር ተፈሪ በር በተባለ የጦር መንደር ላይ የሚገኘውን (በጥር ወር 1970) የከባድ መሳራያ ግምጃ ቤት እና የጠላት ጦርም ድባቅ መታ፡፡ በዚህ ወቅት 5 የጠላት ታንኮችን ከነምድብተኛቸው ደመሰሰ፡፡ ይሁን እንጂ አሁንም ከጠላት በተተኮሰ ፀረ አውሮፕላን ጥይት ተመቶ የሚያበረው አውሮፕላን በእሳት ተያያዘ፡፡ ጀግናው ይህም ጥቃት አላሸበረውም፡፡ እሳቱን በመከላከያ በማጥፋት ወደመጣበት ተመለሰ፡፡ አሁን ግን ደብረዘይት መድረስ አልቻለም፡፡ አውሮፕላኑን ድሬደዋ አየር ማረፊያ አሳረፈው፡፡ አውሮፕላኑም ተጠግኖ እንደገና ለግዳጅ በቃ፡፡
                              ይህ ጀግና፤ ከሚያዝያ ወር 1970 ጀምሮ ኤርትራ ወደሚገኘው 2ኛው አየር ምድብ እንዲዛወር ተደረገ፡፡ ሻለቃ በዛብህ ጴጥሮስ የሶማሊያን ወረራ ለመቀልበስ ከሐምሌ ወር 1969 እስከ የካቲት ወር 1970 በተደረገ የመከላከልም ሆነ የማጥቃት ውጊያ 191 ጊዜ ወደጠላት ወረዳ በርሯል፡፡ የጠላትን እግረኛ እና የሜካናይስድ ጦር፤ ተዋጊ አውሮፕላንና የራዳር ጣብያዎችን ደምስሷል፡፡ በዚህ የላቀ እና ታላቅ ሀገራዊ ተጋድሎ ላበረከተው አስተዋፅኦ በወቅቱ የነበረው የኢትዮጵያ መንግስት መስከረም 3 ቀን 1972 ዓ.ም “የላቀ የጦር ሜዳ ጀብዱ ሜዳይ” ሸልሞታል፡፡
                              እዚህ ላይ ሻለቃ በዛብህ ጴጥሮስ ህዳር 21 ቀን 1972 ዓም ለንባብ በበቃው “ታጠቅ” የተሰኘ የሰራዊቱ ጋዜጣ ላይ ከሰጠው ቃለ ምልልስ የሚከተለውን መጥቀስ ይገባል፡፡ እነሆ፡-
                              “… እኛ ብንሞት ሌላ ሰው ይተካናል፤ መተኪያ የሌላት ኢትዮጵያ ከሞተች ግን ተተኪው ትውልድ ስለሚሞት ዋጋ አይኖረውም፡፡ የሀገርን ሉአላዊነት በአስተማማኝነት መጠበቅ ቆራጥነት እና ልበ ሙሉነት ይጠይቃል፡፡ እኛ በሕይወት ቆመን እያየን ጠላት አንዲት ስንዝር መሬት ቆርሶ መሄድ ቀርቶ በአንድ እግሩ እንኳ ሊቆምባት አይችልም፡፡ ከሀገር ወዲያ ሌላ መኖሪያ ዋሻ ስለሌለ በሃገር እና በነፃነት ጉዳይ ምንም ቀልድ ሊኖር አይችልም፡፡…”
                              ይህ ጀግናችን የተናገረውን ካለማወላወል በተግባር የፈፀመ ብርቅዬ የኢትዮጵያ ልጅ ነው፡፡ ከሶማሊያ ወረራ በኋላ ወደኤርትራ ዘምቶ እስከ 1977 ድረስ ግዳጁን በአግባቡ የተወጣ አርበኛ ነው፡፡ በ1977 ዓም ግን ከሻዕቢያ ጋር እየተዋጋ ሳለ አውሮፕላኑ ተመታ፡፡ አሁን ግን ወደተነሳበት ቦታ መመለስ አልቻለም፤ በሻዕቢያ እጅ ወደቀ፡፡ ጀግናችን እስረኛ ሆነ፡፡ በ1983 ዓም ከእስር ተለቆ ከቤተሰቡ ጋ መቀላቀልም ችሎ ነበር፡፡
                              ከ7 ዓመት በኋላ በ1990ዓም የኢህአዴግ ወዳጅ የነበረው ሻዕቢያ ጠላት ሆኖ መጣ፡፡ ባድመን ወረረ፡፡ የኢትዮጵያውያን ቁጣ ነደደ፡፡ የ3 ወንዶች እና የ2 ሴቶች አባት የሆነው ኮሎኔል በዛብህ የሀገሩን ክብር ለማስመለስ እና ሻዕቢያን ለመደምሰስ ዳግም ዘመተ፡፡ እንደልማዱ ተዋጊ አውሮፕላኑን እየሰገረ የሻዕቢያን ጦር አከርካሪ መሰባበሩን ቀጠለ፡፡
                              ግንቦት 5 ቀን 1990 ዓም ኮሎኔል በዛብህ ጴጥሮስ ወደኤርትራ ምድር ዘልቀው ከገቡ የኢትዮጵያ አየር ሃይል ተዋጊዎች አንዱ ነበር፡፡ የሚያበረውን አውሮፕላን ዝቅ፤…. እጅግ ዝቅ….. አድርጎ የሻዕቢያን ጦር “አፈር ድሜ እያስጋጠ “ ሳለ ተመታ፤ እንደገና በሻዕቢያ እጅ ወደቀ፡፡ ተማረከ፡፡ የሻዕቢያ እስረኛ ሆነ፡፡
                              እነሆ ይህ የሀገር ፈርጥ፤ ይህ ብርቅዬ ጀግና በሻዕቢያ እጅ ከወደቀ ከነገ በስቲያ ማክሰኞ ድፍን 16 ዓመት ይሆነዋል፡፡ ጀግናችን እስካሁን በሕይወት ይኑር አይኑር በይፋ የታወቀ ወይም የተነገረ ነገር የለም፡፡ “አውራምባ ታይምስ” ድረገፅ ኦክቶበር 16፤ 2013 ከአቦይ ስብሃት ጋ ባደረገው ቃለምልልስ ጀግናችን ሳይገደል እንዳልቀረ ጠቁሟል፡፡ ያሳዝናል፡፡
                              እንዲያም ተባለ እንዲህ ጀግናችን በልባችን ውስጥ ህያው ሆኖ ይኖራል፡፡ የመንግስት አካል ወይም ሌላ ተቆርቋሪ ወገን ይህንን ብርቅዬ ጀግና በይፋ ባያስበውም እኛ ገድሉን እንዘክራለን፡፡ በታሪካችን ውስጥ ከፍ ከፍ እያደረግን እናወሳዋለን፡፡
                              እኔ በግሌ ቦሶማሊያ ወረራ ጊዜ ታላቅ ጀብዱ የፈፀሙትን እነካሳዬ ጨመዳን፤ እነ ለገሰ ተፈራን፤ እነ አሊበርኬን … ወዘተ አስታውሶ የሸለመው ወገን፤ የኮሎኔል በዛብህ ጴጥሮስን ስም እንኳ ለማስታወስ አለመፍቀዱ ያሳዝነኛል፡፡
                              ቢሆንም የኮሎኔል በዛብህ ጴጥሮስ ታሪክ እና ገድል ከመቃብር በላይ ነውና እፅናናለሁ፡፡
                              ይህንን ጀግና አወድሳለሁ፡፡""",
                      style: TextStyle(
                        fontWeight: FontWeight.bold,
                        color: Color.fromARGB(255, 255, 255, 255),
                      ),
                    ),
                  ),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
