// import 'package:flutter/material.dart';

// class Edecha extends StatefulWidget {
//   const Edecha({super.key});

//   @override
//   State<Edecha> createState() => _EdechaState();
// }

// class _EdechaState extends State<Edecha> {
//   @override
//   Widget build(BuildContext context) {
//     return Scaffold(
//       appBar: AppBar(
//         title: const Text('hadiya era changer<yaahoode> '),
//         automaticallyImplyLeading: false,
//         leading: IconButton(
//           onPressed: () {
//             Navigator.of(context).pop();
//           },
//           icon: const Icon(Icons.arrow_back_ios),
//         ),
//       ),
//       body: SingleChildScrollView(
//         child: Column(
//           children: [
//             Image.asset('images/haddiya25.jpg'),
//             const SizedBox(
//               height: 50,
//             ),
//             const Divider(
//               color: Colors.black,
//             ),
//             Container(
//               margin: const EdgeInsets.all(10.0),
//               padding: const EdgeInsets.all(10.0),
//               color: Colors.blueGrey,
//               width: double.infinity,
//               child: InteractiveViewer(
//                 child: InteractiveViewer(
//                   child: const Center(
//                     child: Text(
//                       "#የሀዲያ_ብሄር_የዘመን_መለወጫ_ያሆዴ_በዓል_አከባበር_ሥነስርዓት_በቀደሙት_ዘመናት "
//                       "የዘመን መለወጫ በዓል በሀዲያ ብሄር ዘንድ በልዩ ዝግጅትና ድምቀት የሚከበር ታላቅ በዓል ነው። በዓሉንም ሀብታምና ደሃ ሳይቀር ሁሉም ለማክበር ይዘጋጃል፣ ምንም ገንዘብ የሌለውም ደሃ ቢኖር በአራጣ ተበድሮም ቢሆን በዓሉን ያከብራል"
//                       "በአካባቢው ማህበረሰብ ባህል የዘር ወራት እንዳበቃ እረኞች ዋሽንት እየነፉ ልዩ ልዩ ጣዕመ ዜማ ያላቸውን ቀረርቶዎች ማሰማት ይጀምራሉ። በየስፍራውም በተለይ በጊቻ (ስንደዶ) ውስጥ ዘራሮኦ ተብለው የሚታወቁና ነጭ ቀለም ያላቸው የመስክ አበባዎች ማበብ ይጀምራሉ። የዋሽንቱ (ገምባቢያ) ድምፅ መሰማትና የእነዚህ አበቦች በየሜዳው ብቅ ብቅ ማለት የመስቀል በዓል መቃረቡን የሚያበስሩ ምልክቶች ናቸው። አስቀድሞ በክረምት ወራት የእርድ ከብቶች በየቤቱ በረት ታስረው መቀለብ መጀመርም ሌላው የመስቀል ዋዜማ ምልክት ነው። ወንዶችና ሴቶችም በየበኩላቸው ዝግጅታቸውን ይቀጥላሉ። እንደያሆዴ በዓል በከፍተኛ ዝግጅት የማይከበረው የዘመን መለወጫ በዓል ይኸውም መስከረም 1 ቀን /በሀዲይኛ ሌንጃ/ ከገባበት ገዜ አንስቶ ልዩ ልዩ መሰናዶዎች ይደረጋሉ። በሃዲያ ባህል የአተካና እና የያሆ ቀን ተብሎ ይጠራል። አተካና በተለይ ለዚህ በዓል ተብሎ ከቆጮ፣ ከወተት፣ ከቅቤና ከአይብ የሚዘጋጅ ባህላዊ የምግብ አይነት ነው። ብዙውን ጊዜ አተካና የሚዘጋጀው በያሆዴ በዓል ወቅት ይሁን እንጂ በሌላውም ጊዜ አልፎ አልፎ ይዘጋጃል። ሆኖም በዓሉን በዓል ከሚያሰኙት ነገሮች መካከል አንደኛው አተካና ነው። ለያሆዴ በዓል ሲባል በጊዜ ታስቦና ተወስኖ የእርድ ከብቶችን መቀለብና በደንብ ማድለብ የታወቀ እንደመሆኑ መጠን ከሰኔ ወር ጀምሮ ከቤት የማይወጡ ከብቶችን በየቤቱ ማየት የተለመደ ነው። ከዚህም ሌላ ለበዓሉ ቀን ተብሎ ጥሩ የግጦሽ መሬት ተከልሎና ታጥሮ፣ ክልክል ሣር /በሀዲይኛ ኩቱራ/ ተብሎ  ለከብቶች የግጦሽ ሣር ይዘጋጃል። "
//                       "በሌላው ረገድ፣ በየጫካው ዛፎችን በመቁረጥና በመፍለጥ በቂ የማገዶ እንጨት ለበዓል አከባበሩ ይዘጋጃል። እያንዳንዱ ቤተሰብ ለበዓሉ አከባበር የሚበቃውን ያህል የማገዶ እንጨት ይሰበስባል፣ በየደጃፉም ይቆልላል። ከዚህም የተነሳ መስቀል ከጫካ ደን አስጨፍጫፊ (በሀዲይኛ ዶሚ ሃቅጉሎ) የሚል ስያሜ ተሰጥቶታል። ወጣት ልጆች ለደመራው እለት የሚያገለግል ችቦ በብዛት ይሰበስባሉ፣ ለመሰብሰብ ለማይችሉና ልጆች ለሌሉዋቸው ቤተሰቦችም በነፃ ያድላሉ፣ በከተሞች እንደሚደረገው፣ ችቦዎች አይሸጡም። ችቦን መሰብሰብም በሀዲይኛ ጦምቦራ ይባላል። ወጣት ልጆች ከሚደሰቱባቸውና የበዓሉን ምንነት ከሚያንፀባርቁባቸው መንገዶች አንዱ ይህ የችቦ ለቀማ ፕሮግራም ነው። ጦምቦራ የሚዘጋጀውም አብዛኛውን ጊዜ በወንዶች ልጆች አማካኝነት ነው።"
//                       "ጦምቦራ በብዛት ከተዘጋጀ በኋላ በደመራው ዕለት ይቃጠላል። የጦምቦራው ብዛትም እንደየቤተሰቡ ይለያያል። ሁልጊዜ በቤተሰብ ውስጥ ባሉት ወንዶች ቁጥር ለያንዳንዳቸው ይዘጋጃል። የያሆ! ያሆዴ! ስርዓት የሚከናወነውም ሰዎች የእንቅልፍ ጊዜያቸውን ወደሚያበቁበት ገደማ ከሌሊቱ አስር ሰዓት ጀምሮ ነው። እያንዳንዱ ቤተሰብ ወይም ደግሞ የሚቀራረቡ ቤተሰቦች በአንድነት ሆነው በረጃጅም ግንዶች ላይ ችቦዎቹን በማቆምና በማስደገፍ ጦምቦራ/ችቦ/ ያቀጣጥላሉ፣ ችቦውም ተቀጣጥሎ እስኪያልቅ ድረስ ያሆ! ተብሎ የሚጠራውን የባህል ጨዋታ በጭፈራ መልክ ይጫወታሉ። የ ያሆ! ጨዋታ አዝማችና የተለያዩ ስንኞች ያሉት ሲሆን ከያንዳንዱ ስንኝ በዃላ ያሆ! የሚለው ቃል ይደጋገማል። ከስንኞቹ ጥቂቶቹን ለመጥቀስ ያህል፣"
//                       "ያሆዴ ያሆዴ ያሆ! ያሆ!"
//                       "በሪ ዋስጉሎ ያሆ! ያሆ!"
//                       "ዶሚ ሃቅጉሎ ያሆ! ያሆ!"
//                       "ዱቢ ኤንጅጉሎ ያሆ! ያሆ!፣ እየተባለ የሚዘፈን ሲሆን ትርጓሜውም፣"
//                       "ያሆዴ ያሆዴ ያሆ! ያሆ!"
//                       "ከጉድጓድ ቆጮ አስጨራሽ ያሆ! ያሆ!"
//                       "ከጫካ ደን አስጨፍጫፊ ያሆ! ያሆ!"
//                       "ከጓሮ ቅመማ ቅመም አስጨራሽ ያሆ! ያሆ!"
//                       "እንደማለት ነው።"
//                       "በያሆ! ስነስርዓት መሰረት ችቦውን በመጀመሪያ የሚያቀጣጥለው የቤቱ አባወራ ነው። ብዙውን ጊዜ አባትና የቤተሰቡ ታላቅ ወንድ ልጆች ይሆናሉ። አባወራው በመጀመሪያ ችቦውን እንዳቀጣጠለ ቤቱንና ቤተሰቡን ይባርካል/ይመርቃል፣ የክፋትና የርኩሰት መናፍስት ከቤተሰቡና ከቤቱ እንዲርቁ፣ እንዲወገዱ ምኞቱን በመግለጽ ችቦውን አቀጣጥሎ ቤቱን በሙሉ እየዞረ ያዳርሳል፣ የከብቶች በረትና ጓዳም ያዳርሳል። በቤተሰብ ውስጥ ጭቅጭቅ፣ ጠብና አለመግባባት ካለ በመስቀል በዓል ምክንያት በአዲሱ ዓመት ይወገዱ የሚል ምኞቱን ይገልፃል። ከዚያ በኋላ ልጆች አባታቸውን ተከትለው ይወጡና የያሆ! ስነስርዓት ይፈፅማሉ።"
//                       "ከጳጉሜ ጀምሮ  በዓሉ እየተቃረበ ስለሚሄድ የገበያው ሁኔታ ልዩነት ማሳየት ይጀምራል። አንደኛ፣ ባልተለመደ ሁኔታ ያለጊዜው ጠዋት ጠዋት የመቆምና በፍጥነት የመበተን አዝማሚያ ይታያል። ሁለተኛ፣ የመስቀል በዓል ቆሳቁሶችና ባህላዊ እቃዎች በገበያው ይበዛሉ። ይህም የገበያ ልማዳዊ ስርዓትን በመለወጥ የመዋል ሁኔታ በማህበረሰቡ አባባል መቻዕል ሜራ /የእብደት ገበያ ማለት ነው/ ተብሎ ይጠራል። ከልማዳዊ ሰዓት ውጭ የገበያው መቆም፣ ችኩልነትና ጥድፊያ፣ የገበያተኞች ግርግር፣ የከብቶች ጋጋታ፣ የዕቃዎችና የሸቀጣሸቀጦች መብዛትና መወደድ፣ ሳይነጋ ሌሊቱን ጭምር የሚጓዙ ገበያተኞች መኖርና አንዳንድ ጊዜም በአራዊት የመበላት ሁኔታ፣ ..... .ወዘተ ገበያውን የእብደት ገበያ ያሰኘዋል። አስቀድመው አስበውና አቅደው የሚያስፈልጋቸውን ሁሉ ያዘጋጁ ቤተሰቦች በዚህ የእብደት ገበያ ላይ አይገኙም።"
//                       "የበዓሉ ዕለት ሰዎች ለቅርጫ በቡድን በቡድን ሆነው የቀለቡትን ወይም ከገበያ የገዙትን ከብት ያርዳሉ። የእርድ ክንውን የሚፈፀመው ብዙውን ጊዜ በቤተሰባዊ ዝምድና ወይም በጉርብትና ቅርበት በመሰባሰብ ሲሆን የሚያርደውም ሰው አብዛኛውን ጊዜ የኦርቶዶክስ ተዋህዶ እምነት ተከታይ የሆነ ግለሰብ ነው። ብዙዎች የዚህ እምነት ተከታዮች ከሌሉ ያሉት ጥቂቶች እየዞሩ ለየቅርጫ ቡድኑ እየባረኩና እያረዱ ይመለሳሉ። ይህ በቡድን በቡድን እየተቧደኑ ከብት መግዛት፣ መቀለብ፣ ማድለብና ማረድ ቱታ ተብሎ ይታወቃል። የእርድ ከብቱ የሚቀለብና በቤት ውስጥ ሆኖ የሚደልብ ከሆነ በ ቱታ አባላት ቤት ተራ በተራ ሣር በማቅረብ መቀለብ ይኖርበታል። ይህ የእያንዳንዱ የቱታ አባል ተግባር፣ ሃላፊነትና ግዴታ ነው፣ ካልሆነም ገንዘብ በማዋጣት ሣር ገዝተው ማቅረብ ይኖርባቸዋል። በእርድ እለት ለቱታ አባላት በቂ ቅቤና ሌላውን አገልግሎት ሁሉ አሟልቶ ማቅረብ ያለበት በደጁ የተዘጋጀው ሰንጋ ወይም መሲና ላም የሚታረድበት ደጃፍ ባለቤት ይሆናል።"
//                       "በያሆዴ በዓል አከባበር ዝግጅት ወንዶችና ሴቶች የሚተባበሩና የሚተጋገዙ ሲሆን በተለይ ደግሞ የቤት ውስጥ ስራዎችን ማጠናቀቅ የሴቶች የስራ ድርሻ ይሆናል፣ ይህም በልማዳዊ የህይወት እንቅስቃሴ ውስጥ የታወቀውን የስራ ክፍፍል ያመለክታል። በልዩ ሁኔታ ከእርድ ዕለት በዃላ ሴቶች የክትፎ (ሱልሶኦ) ምሽት ስርዓትን ማዘጋጀት ይጠበቅባቸዋል። ይህ የክትፎ (የሱልሶ) ምሽት ከመቼውም ጊዜ ለየት ያለ ምርጥ ክትፎ ተዘጋጅቶ የሚበላበት ምሽት ይሆናል።",
//                       style: TextStyle(
//                         fontSize: 20,
//                         fontWeight: FontWeight.w800,
//                         color: Colors.white,
//                       ),
//                     ),
//                   ),
//                 ),
//               ),
//             ),
//           ],
//         ),
//       ),
//     );
//   }
// }
import 'package:flutter/material.dart';

class Data {
  String image;
  String name;
  Data({required this.image, required this.name});
}

class EdechaPage extends StatelessWidget {
  final String description;
  final List<String> photos;

  const EdechaPage(
      {required this.description,
      required this.photos,
      Key? key,
      required String image,
      required String name})
      : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Column(
        mainAxisAlignment: MainAxisAlignment.center,
        crossAxisAlignment: CrossAxisAlignment.center,
        children: [
          Expanded(
            child: ListView.builder(
              itemCount: photos.length,
              itemBuilder: (context, index) {
                return Image.asset(photos[index]);
              },
            ),
          ),
          const SizedBox(height: 20),
          Text(
            description,
            style: const TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
          ),
        ],
      ),
    );
  }
}
